# '''
# *
# В структуре данных из 5 урока задание №2 каждому сотруднику
# добавить к параметру "навык" параметр "мастерство" измеряемый от 0 до 100
#
# Написать программу которая анализирует всю структуру данных и выводит сотрудников
# с наибольшим параметром "мастерство" для каждого существующего навыка.
# Пример вывода:
#     1. Python - Иванов - 98
#     2. JS - Петров  - 74
#     3. Базы данных - Николаев - 87
#     ...
#
#
# ** Пример вывода (перед выводам отсортировать по убыванию "мастерства"):
#
#     --------------------------------------------------
#     | № |   Навык     |       ФИО       | Мастерство |
#     ==================================================
#     | 1 | Python      | Иванов Н.С.     |     98     |
#     | 2 | JS          | Петров В.В.     |     87     |
#     | 3 | Базы данных | Николаев Е.Н.   |     74     |
#     ...
# '''
users = [
    {
        "ФИО": "Иванов Иван Иванович",
        "Должность": "Инженер",
        "Год рождения": "1977",
        "Список навыков": [{"Навык": "Электрик", "Мастерство": 85}, {"Навык": "Строитель", "Мастерство": 90}],
        "Дети": [{"Имя": "Даша", "Год рождения": "2001"}, {"Имя": "Егор", "Год рождения": "2005"}]
    },
    {
        "ФИО": "Егоров Егор Егорович",
        "Должность": "Программист",
        "Год рождения": "1990",
        "Список навыков": [{"Навык": "Python", "Мастерство": 98}, {"Навык": "SQL", "Мастерство": 92}],
        "Дети": [{"Имя": "Даша", "Год рождения": "2001"}]
    },
    {
        "ФИО": "Петров Петр Петрович",
        "Должность": "Бухгалтер",
        "Год рождения": "1999",
        "Список навыков": [{"Навык": "Excel", "Мастерство": 88}, {"Навык": "Word", "Мастерство": 91}],
        "Дети": []
    },
    {
        "ФИО": "Николаев Николай Николаевич",
        "Должность": "Аналитик",
        "Год рождения": "1995",
        "Список навыков": [{"Навык": "Python", "Мастерство": 90}, {"Навык": "JS", "Мастерство": 87}],
        "Дети": [{"Имя": "Саша", "Год рождения": "2003"}]
    },
    {
        "ФИО": "Смирнова Яна Яновна ",
        "Должность": "Разработчик",
        "Год рождения": "1992",
        "Список навыков": [{"Навык": "JS", "Мастерство": 95}, {"Навык": "SQL", "Мастерство": 85}],
        "Дети": [{"Имя": "Алексей", "Год рождения": "2007"}]
    }
]

best_by_skill = {}

for emp in users:
    for skill in emp["Список навыков"]:
        name = emp["ФИО"]
        skill_name = skill["Навык"]
        level = skill["Мастерство"]

        if skill_name not in best_by_skill or best_by_skill[skill_name]["Мастерство"] < level:
            best_by_skill[skill_name] = {"ФИО": name, "Мастерство": level}

sorted_skills = []

for skill_name in best_by_skill:
    data = [skill_name, best_by_skill[skill_name]["ФИО"],
            best_by_skill[skill_name]["Мастерство"]]
    sorted_skills.append(data)

n = len(sorted_skills)

for i in range(n):
    for j in range(0, n - i - 1):
        if sorted_skills[j][2] < sorted_skills[j + 1][2]:
            sorted_skills[j], sorted_skills[j + 1] = sorted_skills[j + 1], sorted_skills[j]

print("-------------------------------------------------------")
print("| № |   Навык     |       ФИО       |    Мастерство   |")
print("=======================================================")

for idx in range(len(sorted_skills)):
    skill = sorted_skills[idx][0]
    name = sorted_skills[idx][1]
    level = sorted_skills[idx][2]
    print(f"| {idx + 1:<2} | {skill:<10} | {name:<15} | {level:>10} |")

print("-------------------------------------------------------")